0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 25000;

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    bottom
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    frontAndBack
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    InletN
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }


    walls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 25000;
    }
}


// ************************************************************************* //
