0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    bottom
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    frontAndBack
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    InletN
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }
}


// ************************************************************************* //
