system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares linear;
}

divSchemes
{
    default         none;
    div(tauMC) Gauss linear limited 0.2;
 //   div(phi,U)      bounded Gauss linearUpwind grad(U); 
   // div(phi,e)      leastSquares;//Gauss upwind 1;
    //div(phid,p)     leastSquares limitedLinear 1;
   // div(phi,K)      leastSquares limitedLinear 1;
   // div(phiv,p)     leastSquares limitedLinear 1;
  //  div(phi,k)      bounded Gauss upwind; //tyrb
  //  div(phi,epsilon) bounded Gauss upwind; 
   // div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear; 
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
